Repository: pypi-data/pypi-mirror-237
Catalog: packages/aa-market-manager/aa_market_manager-0.17.0.tar.gz/aa_market_manager-0.17.0/marketmanager/locale/*/LC_MESSAGES/django.po
Languages: es

source: Market Browser
es: Navegador de mercado

source: Market Manager
es: Gestor de mercado

source: Order ID
es: ID del pedido

source: Type
es: Tipo

source: Duration
es: Duración

source: Buy Order
es: Comprar pedido

source: Issued
es: Emitido

source: Location ID
es: ID de ubicación

source: System
es: Sistema

source: Region
es: Región

source: Minimum Volume
es: Volumen mínimo

source: Price
es: Precio

source: Solar System
es: Sistema Solar

source: Station
es: Estación

source: Order Range
es: Rango de pedido

source: Volume Remaining
es: Volumen restante

source: Is Corporation
es: Es Corporación

source: Character
es: Personaje

source: Corporation
es: Corporación

source: Cancelled
es: Cancelado

source: Expired
es: Expirado

source: Order State
es: Estado del pedido

source: Structure ID
es: ID de estructura

source: Name
es: Nombre

source: Owner Corporation ID
es: ID del propietario de la corporación

source: Pull Market Orders
es: Obtener órdenes de mercado

source: Managed By App
es: Gestionado por la aplicación

source: Managed App-Identifier
es: Identificador de aplicación gestionado

source: Managed App Reason
es: Razón de la aplicación gestionada

source: quantity
es: cantidad

source: Structure
es: Estructura

source: Structure Type Filter
es: Filtro de tipo de estructura

source: Jita Comparison %
es: Comparación de Jita %

source: Channels
es: Canales

source: Debug Webhook
es: Depuración de Webhook

source: Debug Channels
es: Canales de depuración

source: EVE Type
es: Tipo de EVE

source: Volume
es: Volumen

source: Last Task Runtime
es: Tiempo de ejecución de la última tarea

source: Last Result Volume
es: Volumen del último resultado

source: Fetch Regions
es: Obtener regiones

source: ESI Token
es: Token ESI

source: Valid Corporation Markets for this Token
es: Corporaciones de mercado válidas para este token

source: Valid Structure Markets for this Token
es: Estructuras de mercado válidas para este token

source: Disabled due to Failure, Check reason, adjust config and re-enable
es: Desactivado por fallo, compruebe el motivo, ajuste la configuración y vuelva a activarlo.

source: Failure Reason
es: Motivo del fallo

source: Buy 5th Percentile
es: Comprar 5º percentil

source: Sell 5th Percentile
es: Vender 5º percentil

source: Buy Weighted Average
es: Compra media ponderada

source: Sell Weighted Average
es: Vender media ponderada

source: Buy Median
es: Comprar mediana

source: Sell Median
es: Vender mediana

source: Buy Orders
es: Órdenes de compra

source: Quantity
es: Cantidad

source: Location
es: Ubicación

source: Expires
es: Expira en

source: Last Updated
es: Última actualización

source: Owned Character Orders
es: Órdenes de personajes en propiedad

source: Owned Corporation Orders
es: Órdenes de corporaciones en propiedad

source: Sell Orders
es: Órdenes de venta

source: Missing Quantity
es: Cantidad que falta
