Repository: pypi-data/pypi-mirror-237
Catalog: packages/aa-market-manager/aa_market_manager-0.17.0-py3-none-any.whl/marketmanager/locale/*/LC_MESSAGES/django.po
Languages: fr_fr, ja, ru

source: Market Browser
ja: マーケットブラウザー
ru: Обзор рынка

source: Market Manager
ja: マーケットマネージャー
ru: Менежер рынка

source: Order ID
ja: オーダー ID
ru: ИД заказа

source: Type
ja: タイプ
ru: Тип

source: Duration
fr_fr: Durée
ja: 所要時間
ru: Длительность

source: Buy Order
fr_fr: Ordre d'achat
ja: 購入注文
ru: Заказ на покупку

source: Issued
fr_fr: Envoyer
ja: 発行済み
ru: Клиент

source: Location ID
ja: ロケーション ID
ru: ИД расположения

source: System
fr_fr: Système
ja: システム
ru: Система

source: Region
fr_fr: Région
ja: リージョン
ru: Регион

source: Minimum Volume
fr_fr: Volume minimum
ja: 最小数量
ru: Минимальный объём

source: Price
fr_fr: Prix
ja: 価格
ru: Цена

source: Solar System
fr_fr: Système solaire
ja: ソーラーシステム
ru: Система

source: Station
ja: ステーション
ru: Станиция

source: Order Range
fr_fr: Porter des commandes
ja: 注文範囲
ru: Дальность заказа

source: Volume Remaining
fr_fr: Volume restant
ja: 残りの数量
ru: Оставшийся объём

source: Is Corporation
fr_fr: Est une Corporation
ru: Корпоративный

source: Wallet Division
fr_fr: Division des portefeuilles
ja: ウォレット部門
ru: Финансовое подразделение

source: Character
fr_fr: Personnage
ja: キャラクター
ru: Персонаж

source: Corporation
ja: コーポレーション
ru: Корпорация

source: Cancelled
fr_fr: Annulé
ja: キャンセルされました
ru: Отменено

source: Expired
fr_fr: Expiré
ja: 有効期限切れ
ru: Истекло

source: Order State
fr_fr: État de la commande
ja: 注文状況
ru: Состояние заказа

source: Structure ID
fr_fr: ID de structure
ja: ストラクチャ ID
ru: ИД структуры

source: Name
fr_fr: Nom
ja: 名前
ru: Имя

source: Owner Corporation ID
fr_fr: Identifiant de la Corporation propriétaire
ja: オーナーコーポレーション ID
ru: ИД корпорации владельца

source: Pull Market Orders
ja: プルマーケット注文
ru: Взять рыночные заказы

source: URL
ru: УРЛ

source: Managed By App
fr_fr: Géré par application
ja: アプリによる管理
ru: Управляется приложением

source: Managed App-Identifier
fr_fr: Identifiant d'application géré
ja: アプリ識別による管理
ru: Управляемый идентификатор приложения

source: Managed App Reason
fr_fr: Raison de l'application gérée
ja: 管理対象アプリの理由
ru: Управляемая причина приложения

source: quantity
fr_fr: quantité
ja: 数量
ru: количество

source: Structure
ja: ストラクチャ
ru: Структура

source: Structure Type Filter
fr_fr: Filtre de type de structure
ja: ストラクチャタイプフィルター
ru: Фильтр структур

source: Jita Comparison %
fr_fr: Comparaison de Jita %
ja: ジタ価格との比較%
ru: Сравнение с Jita %

source: Webhooks
ja: ウェブフック
ru: Веб-хуки

source: Channels
fr_fr: Chaînes
ja: チャンネル
ru: Каналы

source: Debug Webhook
ja: ウェブフックのデバッグ
ru: Отладочный веб-хук

source: Debug Channels
fr_fr: Canaux de débogage
ja: デバッグチャネル
ru: Отладочные каналы

source: EVE Type
fr_fr: Type EVE
ja: EVEタイプ
ru: Тип EVE

source: Volume
ja: 数量
ru: Объём

source: Managed Watch Configs
ja: マネージドウォッチ設定
ru: Управляемый просмотр конфигурации

source: Last Task Runtime
fr_fr: Exécution de la dernière tâche
ja: 最終タスクランタイム
ru: Время выполнения последней задачи

source: Last Result Volume
fr_fr: Volume du dernier résultat
ja: 最終結果数量
ru: Последний итоговый объём

source: Fetch Regions
fr_fr: Extraire les régions
ja: リージョンを取得
ru: Получить регионы

source: ESI Token
ja: ESI トークン
ru: Токен ESI

source: Valid Corporation Markets for this Token
ja: このトークンが有効なコーポレーション市場
ru: Допустимые рынки корпораций для этого токена

source: Valid Structure Markets for this Token
ja: このトークンが有効なストラクチャマーケット
ru: Допустимые рынки структур для этого региона

source: Disabled due to Failure, Check reason, adjust config and re-enable
fr_fr: Désactivé en raison d'un échec, vérifiez la raison, ajustez la configuration et réactivez
ja: 何らかの障害のため無効化されました。理由を確認し、設定を調整して再度有効にしてください
ru: Отключено из-за неисправности, проверьте причину, поправьте конфигурацию и попробуйте включить снова

source: Failure Reason
fr_fr: Raison de l'échec
ja: 障害が発生した理由
ru: Причина неисправности

source: Buy 5th Percentile
fr_fr: Acheter le 5e percentile
ja: 5パーセンタイルを購入
ru: Покупка, процентиль 5%

source: Sell 5th Percentile
fr_fr: Vendre le 5e percentile
ja: 5パーセンタイルを売る
ru: Продажа, процентиль 5%

source: Buy Weighted Average
fr_fr: Acheter une moyenne pondérée
ja: 加重平均を購入
ru: Покупка, взвешенное среднее

source: Sell Weighted Average
fr_fr: Moyenne pondérée des ventes
ja: 加重平均を売却
ru: Продажа, взвешенное среднее

source: Buy Median
fr_fr: Acheter Médiane
ja: 中央値を購入
ru: Покупка, медиана

source: Sell Median
fr_fr: Vendre Médiane
ja: 中央値を売る
ru: Продажа, медиана

source: Buy Orders
fr_fr: Commandes d'achat
ja: 購入注文
ru: Заказы на покупку

source: Quantity
fr_fr: Quantité
ja: 数量
ru: Количество

source: Location
fr_fr: Lieu
ja: ロケーション
ru: Расположение

source: Expires
fr_fr: Expire
ja: 期限切れ
ru: Истекает

source: Last Updated
fr_fr: Dernière mise à jour
ja: 最終更新日
ru: Последнее обновление

source: Owned Character Orders
fr_fr: Commandes de personnages possédés
ja: 所有しているキャラクターオーダー
ru: Заказы моего персонажа

source: Owned Corporation Orders
ja: 所有しているコーポレーションの注文
ru: Заказы моей корпорации

source: Sell Orders
fr_fr: Commandes de vente
ja: 注文を売る
ru: Заказы на продажу

source: Market Watches
fr_fr: Surveillance des marcher
ja: マーケットウォッチ
ru: Наблюдатели рынка

source: Missing Quantity
fr_fr: Quantité manquante
ja: 数量が不足しています
ru: Отсутствует количество

source: TypeStatistics Calculation Regions
ja: タイプ:統計計算リージョン
